# RefTableParamName Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RefTableParamName Property
ParameterTypeId Class See Also
---
"Parameter Name"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RefTableParamName { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RefTableParamName As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RefTableParamName {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace